# -*- mode:org ; eval: (progn (visual-line-mode 0) (toggle-truncate-lines 1)) -*-
#+TITLE: Kuhsee Marathon Challenge
#+AUTHOR: Dieter Schaab
#+EMAIL:
#+DESCRIPTION: Kuhsee Marathon Challenge

#+begin_comment
(org-export-to-file 'html "../gh-pages/index.html")
#+end_comment

#+begin_comment
Countdown creation url: logwork.com/countdown-timer
Colors:
- Background #336699
- Digits Color: #ffffff
- Text Color: #bbbbbb
- Time Units Color: #bbbbbb
#+end_comment

#+BEGIN_EXPORT html
<script src="https://cdn.logwork.com/widget/countdown.js"></script>
<a
  href="https://logwork.com/countdown-1avz"
  class="countdown-timer"
  data-style="flip2"
  data-timezone="Europe/Berlin"
  data-language="de"
  data-textcolor="#5c5658"
  data-date="2025-11-30 9:00"
  data-background="#fece22"
  data-digitscolor="#5c5658"
  data-unitscolor="#5c5658">8. KMC</a>
#+END_EXPORT

* Finisher
#+name: finisher
#+ATTR_HTML: :class styledtablelastrow
#+ATTR_HTML: :border 1
#+ATTR_HTML: :rules all
#+ATTR_HTML: :frame border
#+ATTR_HTML: :width 100%
| <l>          | <l>        | <c>  | <c>  | <c>  | <c>  | <c>  | <c>  | <c>  | <c>  |  <c>  |
| Nachname     | Vorname    | 2018 | 2019 | 2020 | 2021 | 2022 | 2023 | 2024 | 2025 | Summe |
|--------------+------------+------+------+------+------+------+------+------+------+-------|
| Baierl       | Andrea     |      |      |      |      |      |      |  1   |      |   1   |
| Benkert      | Ralph      |      |      |      |      |      |      |  1   |      |   1   |
| Berger       | Charly     |      |      |      |      |  1   |  1   |  1   |      |   3   |
| Beyer        | Simone     |      |      |      |      |      |      |      |  1   |   1   |
| Bicak        | Murat      |      |      |      |      |      |      |  1   |      |   1   |
| Bischoff     | Rainer     |      |      |  1   |      |      |      |      |      |   1   |
| Carpené      | Roberto    |      |      |      |      |      |      |  1   |      |   1   |
| Claudia      | Acosta     |      |      |      |      |      |      |      |  1   |   1   |
| Claus        | Matthias   |      |      |      |      |      |      |  1   |  1   |   2   |
| Csavajda     | Norbert    |      |      |      |      |      |      |      |  1   |   1   |
| Ecker        | Fabian     |      |      |      |      |  1   |      |      |      |   1   |
| Einhellinger | Birgit     |      |      |      |      |      |      |  1   |  1   |   2   |
| Einmüller    | Peter      |      |      |      |  1   |  1   |  1   |      |  1   |   4   |
| Fischer      | Martin     |      |      |      |      |      |      |      |  1   |   1   |
| Früh         | Bernd      |      |      |      |      |      |      |  1   |      |   1   |
| Gamperl      | Elisabeth  |      |      |      |      |      |  1   |  1   |  1   |   3   |
| Geier        | Jürgen     |      |      |      |      |      |      |  1   |      |   1   |
| Giertz       | Katrin     |      |      |      |      |      |      |      |  1   |   1   |
| Grammer      | Julia      |      |      |      |      |      |      |      |  1   |   1   |
| Grashei      | Alexandra  |      |      |      |  1   |      |  1   |  1   |  1   |   4   |
| Greppmeir    | Andreas    |      |      |      |      |      |      |      |  1   |   1   |
| Grieger      | Timo       |      |      |      |      |      |      |      |  1   |   1   |
| Grändorf     | Dennis     |  1   |      |  1   |      |      |      |      |      |   2   |
| Grün         | Katrin     |      |      |      |      |      |      |  1   |  1   |   2   |
| Hellmann     | Carsten    |      |  1   |  1   |  1   |      |      |      |      |   3   |
| Herrmann     | Florian    |      |      |      |      |      |      |      |  1   |   1   |
| Hinze        | Frederik   |      |      |      |      |      |      |      |  1   |   1   |
| Jetzlsperger | Klaus      |      |      |      |      |      |  1   |  1   |  1   |   3   |
| Joos         | Stehpan    |  1   |  1   |  1   |      |      |      |      |      |   3   |
| Kaleja       | Yvonne     |      |      |      |      |  1   |  1   |      |  1   |   3   |
| Kandler      | Alexandra  |      |      |      |      |      |      |  1   |      |   1   |
| Kliem        | Manfred    |      |      |  1   |      |      |      |      |      |   1   |
| Klinger      | Thomas     |      |      |      |      |      |  1   |      |      |   1   |
| Klopfer      | Jürgen     |      |      |      |      |      |      |      |  1   |   1   |
| Komander     | Dominik    |      |      |      |      |      |      |  1   |      |   1   |
| Krauss       | Roland     |      |      |      |      |      |      |  1   |  1   |   2   |
| Lange        | Julia      |      |      |      |      |      |      |      |  1   |   1   |
| Lasar        | Michael    |      |      |      |      |      |      |      |  1   |   1   |
| Leister      | Andreas    |      |      |      |      |      |      |      |  1   |   1   |
| Leister      | Johannes   |      |      |      |      |      |      |  1   |  1   |   2   |
| Leister      | Markus     |      |      |      |      |      |      |      |  1   |   1   |
| Lenhard      | Iris       |      |      |      |      |      |      |  1   |      |   1   |
| Lindel       | Claudius   |      |      |      |      |      |      |  1   |      |   1   |
| Machel       | Michael    |      |      |      |      |  1   |  1   |      |      |   2   |
| Magg         | Christoph  |      |  1   |  1   |  1   |  1   |  1   |  1   |  1   |   7   |
| Mai          | Sybille    |      |      |  1   |      |      |      |      |      |   1   |
| Manhard      | Bernie     |      |      |      |      |      |  1   |  1   |  1   |   3   |
| Marcel       | Achzet     |      |      |      |      |      |      |  1   |      |   1   |
| Mayr         | Richard    |      |      |      |      |      |  1   |      |      |   1   |
| Merk         | Tobias     |      |      |      |      |      |      |  1   |      |   1   |
| Mielke       | Marian     |      |      |  1   |  1   |  1   |      |      |      |   3   |
| Miller       | Paul       |      |      |      |      |      |      |      |  1   |   1   |
| Mittomayer   | Bastian    |      |      |      |      |      |  1   |  1   |      |   2   |
| Nagl         | Melanie    |      |      |      |      |      |  1   |      |      |   1   |
| Naschilewski | Alexander  |      |      |      |      |      |  1   |      |      |   1   |
| Nemela       | Daniela    |      |      |      |      |      |      |      |  1   |   1   |
| Neumann      | Conni      |      |      |      |      |      |  1   |      |      |   1   |
| Penning      | Claudia    |      |      |      |  1   |      |      |      |      |   1   |
| Pitsch       | Udo        |      |      |      |      |      |  1   |      |  1   |   2   |
| Pohle        | Florian    |      |      |      |      |      |      |  1   |  1   |   2   |
| Quaet-Faslem | Philipp    |      |      |      |      |      |      |  1   |      |   1   |
| Rankl        | Dominik    |      |      |      |      |      |      |      |  1   |   1   |
| Roch         | Karl       |      |      |      |      |      |      |  1   |      |   1   |
| Roland       | Frank      |      |      |  1   |  1   |  1   |  1   |  1   |  1   |   6   |
| Rupprecht    | Michael    |      |      |      |      |  1   |  1   |  1   |  1   |   4   |
| Rupprecht    | Sophie     |      |      |      |      |      |      |  1   |      |   1   |
| Safronov     | Kirill     |      |      |      |      |  1   |  1   |  1   |  1   |   4   |
| Sämisch      | Mandy      |      |      |      |      |      |      |  1   |  1   |   2   |
| Schaab       | Dieter     |  1   |  1   |  1   |  1   |  1   |  1   |  1   |  1   |   8   |
| Scheele      | Michael    |      |      |      |      |      |      |  1   |      |   1   |
| Schmidt      | Thomas     |      |      |      |      |      |      |      |  1   |   1   |
| Schneider    | Stefan     |      |      |      |      |  1   |  1   |  1   |  1   |   4   |
| Schwarz      | Maximilian |      |      |      |      |      |      |      |  1   |   1   |
| Siman        | Milan      |      |      |      |      |      |      |  1   |  1   |   2   |
| Sommer       | Tom        |      |      |      |      |      |      |      |  1   |   1   |
| Steinert     | Sven       |      |      |      |      |      |      |  1   |  1   |   2   |
| Turzynski    | Michael    |      |      |      |      |      |  1   |  1   |      |   2   |
| Utz          | Christian  |      |      |      |  1   |      |  1   |  1   |      |   3   |
| Vogel        | Simon      |      |      |      |      |  1   |  1   |      |      |   2   |
| Volk         | Peter      |      |      |      |      |  1   |      |      |      |   1   |
| von Hofer    | Moritz     |      |  1   |  1   |      |      |      |      |  1   |   3   |
| Waldow       | Maximilian |      |      |      |      |  1   |      |      |      |   1   |
| Weber        | Bernhard   |      |      |      |      |      |      |      |  1   |   1   |
| Wenzel       | Christoph  |      |      |      |      |      |      |      |  1   |   1   |
| Winkelmann   | Sven       |      |      |  1   |  1   |      |      |      |      |   2   |
| Zischke      | Mathias    |      |      |      |      |      |  1   |      |  1   |   2   |
|              |            |  3   |  5   |  12  |  10  |  15  |  25  |  39  |  47  |  156  |
#+tblfm: @>$11..@>$>>=vsum(@<<<..@>>)::@<<<$11..@>>$11=vsum($3..$>>)

#+HEADER: :cache yes
#+HEADER: :exports none
#+HEADER: :results value
#+HEADER: :var table=finisher[1:-2,0:-3]
#+BEGIN_SRC emacs-lisp
table
#+END_SRC

#+RESULTS[a84e3e9d15e975cb1a5f64ccca91a96d143f08e0]:
| Berger       | Charly     |   |   |   |   | 1 | 1 |
| Bischoff     | Rainer     |   |   | 1 |   |   |   |
| Ecker        | Fabian     |   |   |   |   | 1 |   |
| Einmüller    | Peter      |   |   |   | 1 | 1 | 1 |
| Gamperl      | Elisabeth  |   |   |   |   |   | 1 |
| Grashei      | Alexandra  |   |   |   | 1 |   | 1 |
| Grändorf     | Dennis     | 1 |   | 1 |   |   |   |
| Hellmann     | Carsten    |   | 1 | 1 | 1 |   |   |
| Jetzlsperger | Klaus      |   |   |   |   |   | 1 |
| Joos         | Stehpan    | 1 | 1 | 1 |   |   |   |
| Kaleja       | Yvonne     |   |   |   |   | 1 | 1 |
| Kliem        | Manfred    |   |   | 1 |   |   |   |
| Klinger      | Thomas     |   |   |   |   |   | 1 |
| Machel       | Michael    |   |   |   |   | 1 | 1 |
| Magg         | Christoph  |   | 1 | 1 | 1 | 1 | 1 |
| Manhard      | Bernie     |   |   |   |   |   | 1 |
| Mai          | Sybille    |   |   | 1 |   |   |   |
| Mayr         | Richard    |   |   |   |   |   | 1 |
| Mielke       | Marian     |   |   | 1 | 1 | 1 |   |
| Mittomayer   | Bastian    |   |   |   |   |   | 1 |
| Nagl         | Melanie    |   |   |   |   |   | 1 |
| Naschilewski | Alexander  |   |   |   |   |   | 1 |
| Neumann      | Conni      |   |   |   |   |   | 1 |
| Penning      | Claudia    |   |   |   | 1 |   |   |
| Pitsch       | Udo        |   |   |   |   |   | 1 |
| Roland       | Frank      |   |   | 1 | 1 | 1 | 1 |
| Rupprecht    | Michael    |   |   |   |   | 1 | 1 |
| Safronov     | Kirill     |   |   |   |   | 1 | 1 |
| Schaab       | Dieter     | 1 | 1 | 1 | 1 | 1 | 1 |
| Schneider    | Stefan     |   |   |   |   | 1 | 1 |
| Turzynski    | Michael    |   |   |   |   |   | 1 |
| Utz          | Christian  |   |   |   | 1 |   | 1 |
| Vogel        | Simon      |   |   |   |   | 1 | 1 |
| Volk         | Peter      |   |   |   |   | 1 |   |
| Waldow       | Maximilian |   |   |   |   | 1 |   |
| Winkelmann   | Sven       |   |   | 1 | 1 |   |   |
| Zischke      | Mathias    |   |   |   |   |   | 1 |
| von Hofer    | Moritz     |   | 1 | 1 |   |   |   |

#+HEADER: :exports none
#+HEADER: :var data=finisher[1:-2,0:-3]
#+begin_src ruby
require 'csv'

# Extract relevant data from the table
participants = data.map do |row|
  row
end

# Create CSV file
CSV.open("participants.csv", "wb") do |csv|
  csv << ["Nachname", "Vorname", "2018", "2019", "2020", "2021", "2022", "2023"]
  participants.each do |participant|
    csv << participant
  end
end

puts "CSV file 'participants.csv' created successfully."
#+end_src

#+RESULTS:
: nil

